#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/philward_io/philward_io/runs/run-cUR9SgTYv53r2P8B

Waiting for the plan to start...

Terraform v1.2.8
on linux_amd64
Initializing plugins and modules...
aws_acm_certificate.acm_certificate: Refreshing state... [id=arn:aws:acm:us-east-1:542829616420:certificate/4f2a114c-9f30-4784-b67b-5aee7a41f19a]
data.aws_route53_zone.philward_io_zone: Reading...
aws_cloudfront_origin_access_identity.resume_oai: Refreshing state... [id=E1AVBUZT0CBMF6]
aws_route53_zone.philward_io_zone: Refreshing state... [id=Z003529526RCV8G5J1PS7]
aws_route53domains_registered_domain.philward_io_domain: Refreshing state... [id=philward.io]
data.aws_caller_identity.current: Reading...
data.aws_cloudfront_cache_policy.resume_distribution_cache_policy: Reading...
aws_s3_bucket.legacy_resume_bucket: Refreshing state... [id=legacy-resume.philward.io]
aws_cloudfront_response_headers_policy.security_headers_policy: Refreshing state... [id=dbd58526-3795-4dea-a38a-b0d743f4caaf]
aws_s3_bucket.resume_bucket: Refreshing state... [id=resume.philward.io]
data.aws_caller_identity.current: Read complete after 0s [id=542829616420]
data.aws_cloudfront_cache_policy.resume_distribution_cache_policy: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
data.aws_iam_policy_document.kms_ksk_policy: Reading...
data.aws_iam_policy_document.kms_ksk_policy: Read complete after 0s [id=3690054669]
aws_kms_key.dnssec_kms_key: Refreshing state... [id=43f31946-1cde-40ab-a194-21839adc741f]
aws_route53_key_signing_key.philward_io_ksk: Refreshing state... [id=Z003529526RCV8G5J1PS7,philward_io_KSK]
data.aws_route53_zone.philward_io_zone: Read complete after 1s [id=Z003529526RCV8G5J1PS7]
aws_route53_record.acm_validation_record["philward.io"]: Refreshing state... [id=Z003529526RCV8G5J1PS7__c88ce6dbd651a4d32d84f8a6aa562e90.philward.io._CNAME]
aws_route53_record.acm_validation_record["*.philward.io"]: Refreshing state... [id=Z003529526RCV8G5J1PS7__c88ce6dbd651a4d32d84f8a6aa562e90.philward.io._CNAME]
aws_route53_hosted_zone_dnssec.philward_io_dnssec: Refreshing state... [id=Z003529526RCV8G5J1PS7]
aws_s3_bucket_public_access_block.resume_bucket_access_block: Refreshing state... [id=resume.philward.io]
data.aws_iam_policy_document.resume_bucket_policy_document: Reading...
aws_s3_object.resume_bucket_contents["index.html"]: Refreshing state... [id=index.html]
aws_s3_object.resume_bucket_contents["js/scripts.js"]: Refreshing state... [id=js/scripts.js]
aws_s3_object.resume_bucket_contents["assets/img/favicon.png"]: Refreshing state... [id=assets/img/favicon.png]
aws_s3_object.resume_bucket_contents["assets/img/profile.png"]: Refreshing state... [id=assets/img/profile.png]
aws_s3_object.resume_bucket_contents["css/styles.css"]: Refreshing state... [id=css/styles.css]
aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E5CPX462LFNKX]
data.aws_iam_policy_document.resume_bucket_policy_document: Read complete after 0s [id=3877817331]
aws_s3_bucket_policy.resume_bucket_policy: Refreshing state... [id=resume.philward.io]
aws_route53_record.root_domain: Refreshing state... [id=Z003529526RCV8G5J1PS7_philward.io_A]
aws_route53_record.resume_domain: Refreshing state... [id=Z003529526RCV8G5J1PS7_resume.philward.io_A]
data.aws_iam_policy_document.legacy_resume_bucket_policy_document: Reading...
aws_s3_bucket_website_configuration.legacy_bucket_website: Refreshing state... [id=legacy-resume.philward.io]
aws_s3_bucket_acl.legacy_resume_bucket_acl: Refreshing state... [id=legacy-resume.philward.io,public-read]
aws_s3_object.legacy_resume_bucket_contents["legacy_index.html"]: Refreshing state... [id=legacy_index.html]
aws_s3_object.legacy_resume_bucket_contents["reset-fonts-grids.css"]: Refreshing state... [id=reset-fonts-grids.css]
data.aws_iam_policy_document.legacy_resume_bucket_policy_document: Read complete after 0s [id=1724937241]
aws_s3_object.legacy_resume_bucket_contents["resume.css"]: Refreshing state... [id=resume.css]
aws_s3_bucket_policy.legacy_resume_bucket_policy: Refreshing state... [id=legacy-resume.philward.io]
aws_route53_record.legacy_resume_record: Refreshing state... [id=Z003529526RCV8G5J1PS7_legacy-resume.philward.io_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_route53_record.hashnode_blog_domain will be created
  + resource "aws_route53_record" "hashnode_blog_domain" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "blog.philward.io"
      + records         = [
          + "hashnode.network",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z003529526RCV8G5J1PS7"
    }

  # aws_s3_object.resume_bucket_contents["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "resume_bucket_contents" {
      ~ etag               = "457428f17ea4db6d2f03b6fc97d3e412" -> "399a6ebd7b2b8e775ec3cc64b0a14aed"
        id                 = "index.html"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.


```

</details>

*Pushed by: @phil-ward, Action: `pull_request`*